# FooterText Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TaskDialog..::..FooterText Property
TaskDialog Class See Also
---
FooterText is used in the footer area of the task dialog.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public string FooterText { get; set; }
```

Visual Basic
---
```text
Public Property FooterText As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ FooterText {
	String^ get ();
	void set (String^ value);
}
```

# Remarks
HTML Hyperlink tags can be used when specifying Footertext. These will work like normal hyperlinks where clicking them will launch the default browser to the location specified. Revit special cases hyperlinks containing the single character '#' to indicate to launch Revit's contextual help for the dialog. The Topic passed for the contextul help takes the form H[id] where id is the Id for the task dialog.
# See Also
TaskDialog Class
Autodesk.Revit.UI Namespace